var data = [];
var dataStr = '1、捉妖记2<br>\
<br>\
·男女授受不亲，亲了就要成亲<br>\
·天荫:煮饭是我的第三理想，我的第二理想是缝补，你猜我的第一理想是什么？ <br>\
 小岚:是什么？ <br>\
 天荫:就是煮饭加缝补。嘻嘻嘻，没想到吧。<br>\
·作为一个成功的捉妖师，我是怎么走上捉妖这条路呢?<br>\
·所谓生活，不过是一场厮杀。<br>\
<br>\
<br>\
2、阿唐奇遇<br>\
<br>\
·中华小茶宠，为美大步走！<br>\
·在南方一座热闹城市里的一间茶叶店中，生活着一群陶瓷茶宠。<br>\
·他们以被浇茶变色为荣。而阿唐是其中唯一一个怎么浇茶都不会变色的茶宠。<br>\
·为了找到让自己颜色变漂亮的方法，中华小茶宠阿唐决定为美大步走，与机器人小来一起出发，踏上一段寻找未来的历险旅程。<br>\
<br>\
<br>\
3、大闹天竺<br>\
<br>\
·我这个人最恨的就是抛弃。<br>\
·人的一生会错爱很多人，老天爷一定会把最好的留到未来，你要等!<br>\
·你可以牵着我的手<br>\
 但可不可以不要十指相扣<br>\
·你在国内到底得罪谁了?人家跑到印度来杀你。<br>\
·唐森：武空，你得保护我，我就你这么一个朋友。<br>\
.朱天鹏：就凭你们几个小娘们，想干我是不是?哥真的练过。<br>\
<br>\
<br>\
4、蜘蛛侠：英雄归来<br>\
<br>\
·能力越大，责任越大。 <br>\
.With great power comes with great responsibility.<br>\
·Slander is spoken. In print, it’s libel. <br>\
.中伤是口语，印出来就是诽谤。<br>\
·伸张正义必须牺牲小我，即使是自己最珍贵的东西，甚至是梦想。<br>\
<br>\
<br>\
5、六弄咖啡馆<br>\
<br>\
·喜欢是一种能力，被喜欢是一种天赋。<br>\
·三百六十公里，果然很远……你是对的，你说过，距离是浇熄爱情的第一桶冷水，你真的是对的。<br>\
·如果我们的将来不是刻意去凑在一起的，那样的缘分才叫足够。<br>\
·爱不会因为远距离而脆弱，人才会。<br>\
·我想每个人都有过这样的感觉，那种看着一个人的侧脸，然后把心里想说的话在心里说了一遍的感觉，虽然无声，虽然孤独得只有自己知道，但真的很真实。<br>\
<br>\
<br>\
6、后会无期<br>\
<br>\
·我们听过无数的道理，却仍旧过不好这一生。<br>\
·喜欢就会放肆，但爱就是克制。<br>\
·每一次告别，最好用力一点。多说一句，可能是最后一句。多看一眼，可能是最后一眼。<br>\
·有时候，你想证明给一万个人看，到后来，你发现只得到了一个明白的人，那就够了。<br>\
·带不走的留不下，留不下的莫牵挂。<br>\
·她们都是你漫漫长路上，只配错过的好姑娘。<br>\
<br>\
<br>\
7、动物狂欢城<br>\
<br>\
·生活中总会有不顺心的时候，我们都会犯错。<br>\
·我知道，你永远都不会原谅我。我不怪你，换做我，我也不会原谅我自己。<br>\
·好了，到我这来。你们兔子，就是爱哭。<br>\
·I know you love me<br>\
<br>\
<br>\
8、匆匆那年<br>\
<br>\
·那时候，我们以为喜欢就是永远。后来才发现，我们只有曾经，没有永远。<br>\
·我喜欢你 是我的 不是我的 我都喜欢<br>\
·在开始时毫无所谓，在结束时痛彻心扉。<br>\
·你可以打我，你可以骂我，但你千万不要说我没有努力过。<br>\
·我想从这里开始重新来过，和之前不一样的重新来过。<br>\
·既然已匆匆，不如早怀念。<br>\
<br>\
<br>\
9、同桌的妳<br>\
<br>\
·时间太长 我怕等不到你，距离太远 我怕追不上你，爱情太沉 我怕放不下你。<br>\
·这是我们两个人的事，我一个人办不到。<br>\
·总有一天，我会带你去只有我们两个人的地方。<br>\
·记忆总是喜欢添油加醋，它会朝着你期待的方向修改，当你欣喜若狂的时候，真相，会将你惊醒。<br>\
·总有一天，我会带你去只有我们两个人的地方。<br>\
<br>\
<br>\
10、谁的青春不迷茫<br>\
<br>\
·谁的青春不迷茫，其实我们都一样。<br>\
·一些人存在的意义总归是让另一些人成长，然后消失。<br>\
·简单的东西不一定是最好的，但最好的东西一定是简单的。<br>\
·愿你比别人更不怕一个人独处，愿日后想起时你会被自己感动。<br>\
·一个人害怕孤独，两个人害怕辜负。<br>\
<br>\
<br>\
11、三生三世十里桃花<br>\
<br>\
·情这东西，没有遇对人，便是个甚不好的东西。<br>\
·并不是每个人都能将疼痛堂而皇之挂在脸上的，即便没挂在脸上，那痛却是一分也不少的。<br>\
·我会和你成亲，我会是你的眼睛。<br>\
·你若敢死，我立刻便去找折颜要药水，把你忘得干干净净。<br>\
<br>\
<br>\
12、马达加斯加的企鹅<br>\
<br>\
·当世界需要被拯救，地球上最精英的团队就会现身。<br>\
·我们是精英中的精英，击个掌吧！<br>\
·伙计们，听好了，我们一直在等待的任务终于来了。<br>\
·刚才我是一时兴起，但现在情况也不差啊。<br>\
·这才像话，咱们开工吧！<br>\
<br>\
<br>\
13、你的名字<br>\
<br>\
·以彗星为龙，以彗星为绳结。描绘出割裂的彗星舞动的形态。又是一轮岁月。<br>\
·聚拢，成形，捻转，回绕，时而返回，暂歇，再联结。这就是组纽。这就是时间。这就是联结。<br>\
·我们曾经在过去相逢。不，这也许只是错觉，也许只是梦境一般的一厢情愿。也许，只是前世的。<br>\
·重要的人，不能忘记的人，不想忘记的人!悲伤和爱怜，都一样消失。<br>\
<br>\
<br>\
14、青春派<br>\
<br>\
·我叫居然，撒老师班唯一的落榜生。<br>\
·高三一年，我和我妈住在出租屋里，而我爸和狗住在郊区的家。心烦意乱的时候想想我爸，心里就平衡了很多。但此刻，我只想着黄晶晶<br>\
·听说你就是声震学校的毕业照情圣，够厉害，还是跳楼的勇士。<br>\
·有本事单挑，三个打一个算什么本事。<br>\
·因为你的懦弱，让你妈妈在你面前那样羞辱我。这一秒，咱俩什么关系都没有。<br>\
<br>\
<br>\
15、喜欢你<br>\
<br>\
·我只是讨厌你脑子笨，说话没逻辑，做事情欠条理，清醒时犯糊涂，喝醉时更糊涂！家里脏得像猪窝！<br>\
·我没有职位给你，但是我身边有个位置给你。<br>\
·“我也知道我自己太普通了……可是，我是真的觉得他还挺好的。”我根本没有办法选择喜不喜欢你。”<br>\
·爱情是不期而遇的，你不能计划这件事，碰到之后就自己说了算。<br>\
<br>\
<br>\
16、神偷奶爸2<br>\
<br>\
·你装过头了 其实内在是一颗破碎的心。<br>\
·蹩脚的谎话 我甚至都不喜欢她<br>\
·Are you reallyabcgonna save the world? 你真的要拯救世界吗? Yes. Yes, I am. 是的是的 没错<br>\
·You just officially hadabcthe worst date ever. 你圆满完成了史上最糟糕约会<br>\
<br>\
<br>\
17、驯龙高手2<br>\
<br>\
·我知道这希望渺茫，但是你不能总是保护他。<br>\
·哦，上帝不喜欢我。有些人会弄丢刀子，杯子。不，不应该是我啊！我弄丢了一条龙！<br>\
·我父亲让我用头去撞石头，我照做了。我觉得这很疯狂，但是我没问他为什么。<br>\
·不，你想错了，他在乎的不是你的外表，他看重的是你的灵魂。<br>\
<br>\
<br>\
18、小王子<br>\
<br>\
·你知道的—当一个人情绪低落的时候，他会格外喜欢看日落……<br>\
·星星发亮是为了让每一个人有一天都能找到属于自己的星星。<br>\
·如果你随便找个时间过来看我，我就无法体验到那种期待的兴奋生命需要一种仪式感。<br>\
·只有用心才能看到本质―最重要的东西眼睛是无法看到的。<br>\
·时间可以疗愈所有的伤痛。当这离别的悲伤平息后，你会因为我们的结识而感到欣慰。<br>\
<br>\
<br>\
19、哆啦A梦：新·大雄的日本诞生<br>\
<br>\
·我一直在，守着你的天真和笑容。<br>\
·你总是这样轻言放弃的话，无论多久都只会原地踏步。<br>\
·一开始做不到的事就别吹牛啊！总是依靠我依靠我怎么行啊！偶尔也自己努力一下试试啊！<br>\
·每个人都有自己的任务，任务完成了，就离开吧。<br>\
·大雄：“我不想长高” 多啦A梦：“为什么” 大雄：“因为我长高了哆啦A梦就不能牵到我的手了”<br>\
<br>\
<br>\
20、怪兽大学<br>\
<br>\
·你从小学四年级起初就嫉妒我长得帅。<br>\
·“欢迎来上惊吓入门课程”“吓人根本不用学，放胆去吓就好啦!”<br>\
·如果你不吓人，那算哪门子怪兽?<br>\
·我的特长是多长了个脚趾，但没带在身上。<br>\
·自古以来，全世界的孩子都知道，怪物就躲在他们的柜子里。但他们不知道的是，这些怪物并不总是那么吓人。<br>\
';
var d = dataStr.split('<br><br><br>');
for (var i = 0; i < d.length; i++) {
    var c = d[i].split('<br><br>');
    data.push({
        img: c[0].replace('、', ' ') + '.jpg',
        caption: c[0].split('、')[1],
        desc: c[1]
    });
};
